# 按行输入
import sys

# # # ---------------------------------- 10 20 ------------------- 1020 ------------------- 字符串拼接
# # 这个不管写多少个，a 会读所有的个数
# for line in sys.stdin:
#     a = line.split()        # a 就是取的这一行的数值
#     print(a[0] + a[1])      # 这一行中每一个对应就是 a[i]
#
# # ---------------------------------- 10 20 30 ------------------- 60 ------------------- map 会将其转为数值进行相加
# for line in sys.stdin:
#     # strip 会把 开头空格、结尾空格、换行\n、制表符\t 清除掉 —— 这里去掉也不影响
#     # 这个如果只写两个会报错，只读两个写三个也会报错
#     a, b, c = map(int, line.strip().split())
#     print(a + b + c)


# 先设置有 n 行
n = int(input())
# # 2 ----- 2 行 ----- 下面输入 2 行数字 --- 每行只输入一个数字
# # 3
# # 2 -------------- 最终输出 3+2=5
# nums = [int(input()) for _ in range(n)]     # 每读一行转为 int，最后的 nums 是 all 数字一起成一行
# print(sum(nums))

for _ in range(n):
    nums = input().split()                    # 这个依旧是字符串，不是数字 _ 10 20 30 _ 102030
    x, y, z = nums[0], nums[1], nums[2]       # 这个如果不存的话，读第二行就把第一行的覆盖了
    print( x + y + z)